tap "gdubw/gng"
tap "holgerbrandl/tap", trusted: true
tap "osx-cross/arm", trusted: true
tap "osx-cross/avr", trusted: true
tap "qmk/qmk"
tap "static-var/tap", trusted: true
# Atmel AVR MCU programmer
brew "avrdude"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# HID-based USB bootloader for AVR microcontrollers
brew "bootloadhid"
# Command-line tool to manipulate Android App Bundles
brew "bundletool"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Device firmware update based USB programmer for Atmel chips
brew "dfu-programmer"
# USB programmer
brew "dfu-util"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU multiple precision arithmetic library
brew "gmp"
# Profiling and benchmarking tool for Gradle builds
brew "gradle-profiler"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Integer Set Library for the polyhedral model
brew "isl"
# Statically typed programming language for the JVM
brew "kotlin"
# Palette quantization library extracted from pnquant2
brew "libimagequant"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# Library for complex text layout
brew "libraqm"
# Utility for directing compilation
brew "make"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Cross-shell prompt for astronauts
brew "starship"
# Version control system designed to be a better CVS
brew "subversion"
# Command-line integration for Teensy USB development boards
brew "teensy_loader_cli"
# Vi 'workalike' with many additional features
brew "vim"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Gradle is Not Gradle
brew "gdubw/gng/gng", trusted: true
# kscript
brew "holgerbrandl/tap/kscript"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk", trusted: true
# Reduce noisy Gradle output into concise build summaries
brew "static-var/tap/build-brief"
# Android SDK component
cask "android-platform-tools"
# Prevents your sleeping computer from connecting to Bluetooth accessories
cask "bluesnooze"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Voice and text chat software
cask "discord"
cask "font-roboto-mono"
# Utility to hide menu bar items
cask "hiddenbar"
# Optimise your webcam, headset, and Logi Dock for video meetings
cask "logitune"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Music streaming service
cask "spotify"
# To-do & task list manager
cask "ticktick"
# Multimedia player
cask "vlc"
npm "avocado"
