tap "gdubw/gng"
tap "holgerbrandl/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "bat"
brew "bundletool"
brew "cloc"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "imagemagick"
brew "node"
brew "pipx"
brew "starship"
brew "subversion"
brew "vim"
brew "yt-dlp"
brew "gdubw/gng/gng"
brew "holgerbrandl/tap/kscript"
brew "qmk/qmk/qmk"
cask "android-platform-tools"
cask "bluesnooze"
cask "discord"
cask "font-roboto-mono"
cask "hiddenbar"
cask "logitune"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "obsidian"
cask "rar"
cask "spotify"
cask "ticktick"
cask "vlc"
